In [1]:
import numpy as np
import pandas as pd

In [4]:
numbers = list(range(1, 11))
numbers

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [6]:
s = pd.Series(numbers)
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [10]:
df = pd.DataFrame(numbers)
df

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [9]:
df1 = s.to_frame()
df1

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [11]:
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [12]:
s.cumsum()

0     1
1     3
2     6
3    10
4    15
5    21
6    28
7    36
8    45
9    55
dtype: int64

In [14]:
df

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [15]:
df['cumsum'] = s.cumsum()
df

    0  cumsum
0   1       1
1   2       3
2   3       6
3   4      10
4   5      15
5   6      21
6   7      28
7   8      36
8   9      45
9  10      55

In [16]:
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [17]:
s.cumprod()

0          1
1          2
2          6
3         24
4        120
5        720
6       5040
7      40320
8     362880
9    3628800
dtype: int64

In [18]:
df

    0  cumsum
0   1       1
1   2       3
2   3       6
3   4      10
4   5      15
5   6      21
6   7      28
7   8      36
8   9      45
9  10      55

In [19]:
df['cumprod'] = s.cumprod()
df

    0  cumsum  cumprod
0   1       1        1
1   2       3        2
2   3       6        6
3   4      10       24
4   5      15      120
5   6      21      720
6   7      28     5040
7   8      36    40320
8   9      45   362880
9  10      55  3628800

In [20]:
s = pd.Series([10, 11, 12, 13])
s

0    10
1    11
2    12
3    13
dtype: int64

In [21]:
s.pct_change()

0         NaN
1    0.100000
2    0.090909
3    0.083333
dtype: float64

In [23]:
df1 = s.to_frame()
df1

    0
0  10
1  11
2  12
3  13

In [24]:
df1['pct_change'] = s.pct_change()
df1

    0  pct_change
0  10         NaN
1  11    0.100000
2  12    0.090909
3  13    0.083333